MPS/src/Catalogs/ВидыДействийКлиента/ВидыДействийКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДействийКлиента</name>
  <attributes>
    <name>КодДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеКоды</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

MPS/src/Catalogs/ВидыДействийКлиента/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	ПостроительЗапроса = Новый ПостроительЗапроса;	
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Справочники.ВидыДействийКлиента.ПолучитьМакет("ВидыПоУмолчанию").Область());  
	ПостроительЗапроса.Выполнить();   
	ТЗРезультат = ПостроительЗапроса.Результат.Выгрузить(); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗРезультат.КодДействия КАК КодДействия,
	|	ТЗРезультат.Наименование КАК Наименование,
	|	ТЗРезультат.ОписаниеВидаОперации КАК ОписаниеВидаОперации,
	|	ТЗРезультат.ДополнительныеКоды КАК ДополнительныеКоды
	|ПОМЕСТИТЬ ВТ_ВидыПоУмолчанию
	|ИЗ
	|	&ТЗРезультат КАК ТЗРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидыПоУмолчанию.*
	|ИЗ
	|	ВТ_ВидыПоУмолчанию КАК ВТ_ВидыПоУмолчанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДействийКлиента КАК ВидыДействийКлиента
	|		ПО ВТ_ВидыПоУмолчанию.КодДействия = ВидыДействийКлиента.КодДействия
	|ГДЕ
	|	ВидыДействийКлиента.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТЗРезультат", ТЗРезультат);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовыйЭлемент = Справочники.ВидыДействийКлиента.СоздатьЭлемент();
		НовыйЭлемент.КодДействия = Выборка.КодДействия;
		НовыйЭлемент.Наименование = Выборка.Наименование;
		НовыйЭлемент.ОписаниеВидаОперации = Выборка.ОписаниеВидаОперации;
		НовыйЭлемент.ДополнительныеКоды = Выборка.ДополнительныеКоды;
		НовыйЭлемент.Записать();
	КонецЦикла;
	
	Список.Обновить();


КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры
